---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AssemblyType
source: html/c27f22fd-4a8a-12c8-acc8-8264cf24621f.htm
---
# AssemblyType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.